Yr8/8-CS-Cryptography/pages/1_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cryptography</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Cryptography</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/MarcScott/8-CS-Cryptography">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Encryption, Decryption and Keys</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>This module is going to focus on the science of Cryptography.
</li>
<li>It begin with a small research project and conclude with the creation of some simple cryptography algorithms using Python.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Learn It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Alice and Bob are sitting in a classroom and want to send notes to each other, but Eve is sitting in-between them.
</li>
<li>Alice can write a message onto a bit of paper, but she needs to pass it to Eve first.
</li>
<li>Eve can then pass the message onto Bob,  so Bob can read the message.
</li>
<li>Can you see how this system is insecure? Eve is easily able to read the message before passing it onto Bob.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 try">
<h3 id="sec-1-3">Try It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Assemble yourselves into teams of three.
</li>
<li>Can two of you manage to write messages to each other in such away that the third member of your group is unable to read the message?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 badge">
<h3 id="sec-1-4">Badge It - Silver</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Write up the methods you tried to send the messages secretly.
</li>
<li>Use a text editor (Sublime Text for instance) and make sure you save the file with the .txt extension
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 learn">
<h3 id="sec-1-5">Learn It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>The problem is that Alice and Bob are trying to send messages in what is called <code>Plaintext</code>. Plaintext doesn't necessarily have to be text. It is just any information that is being passed between participants that can easily be read by a third party without needing any special measures. Pictures, Video, Audio as well as Text can all be described as Plaintext.
</li>
<li>If Alice and Bob want to communicate privately, they'll need to <code>Encrypt</code> their messages.
</li>
<li><code>Encryption</code> converts information into what is known as <code>Ciphertext</code>. Ciphertext can't easily be read by Eve unless she knows the <code>Key</code> that was used to encrypt the message.
</li>
<li>Let's look at an example.
<ul class="org-ul">
<li>Alice tells Bob the key she is going to use prior to the lesson.
</li>
<li>The key is 'I'll write the message backwards'
</li>
<li>Alice then writes down her Plaintext message on a piece of paper - <code>I'm loving this lesson on Encryption</code>
</li>
<li>On a second piece of paper, Alice uses her <i>key</i> to <i>encrypt</i> the message. <code>noitpyrcnE no nossel siht gnivol m'I</code>
</li>
<li>Alice can then pass the message to Eve, who can't read it (well not quickly anyway).
</li>
<li>Eve passes the message onto Bob.
</li>
<li>Bob (knowing the key) can then <i>decrypt</i> the Ciphertext and write out the Plaintext.
</li>
</ul>
</li>
<li>Of course the encryption method shown above isn't very secure. We'd call it weak encryption.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 research">
<h3 id="sec-1-6">Research It</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Encryption methods have been used for millennia by various people.
</li>
<li>Watch the video below and then answer the questions in the Badge It section.
</li>
</ul>
<iframe width="420" height="315" src="https://www.youtube.com/embed/sMOZf4GN3oc" frameborder="0" allowfullscreen></iframe>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3 badge">
<h3 id="sec-1-7">Badge It - Gold</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li>Why is the cipher called the Caesar Cipher?
</li>
<li>Why is it known as a Substitution Cipher?
</li>
<li>What is meant by the term <i>Shift</i>?
</li>
<li>What is <i>Frequency Analysis</i>?
</li>
<li>What is the most commonly used letter in the English language?
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3 learn">
<h3 id="sec-1-8">Learn It</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Hopefully you can see that the Caesar Cipher isn't a particularly secure method of encrypting PlainText.
</li>
<li>To try and combat <i>Frequency Analysis</i> the original Caesar Cipher was improved upon, by using more than one shift value.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3 research">
<h3 id="sec-1-9">Research It</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Watch this video on the <code>Vignere Cipher</code>
</li>
</ul>

<iframe width="560" height="315" src="https://www.youtube.com/embed/9zASwVoshiM" frameborder="0" allowfullscreen></iframe>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3 badge">
<h3 id="sec-1-10">Badge It - Platinum</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>In your own words (remember to use a text editor and the .txt extension), provide a brief description of how the Vigenere Cipher works.
</li>
<li>Now try decrypting this message using the Vigenere Cipher and the key of "compsci"
</li>
</ul>
<blockquote>
<p>
Ecyemvmt goxwpkg we cg owts mqgwb ecyemvmtg fwsp iuhddfqua we ptqcv hqawukqdqh 
</p>
</blockquote>
<ul class="org-ul">
<li>Keep the answer a secret so that your friends have to work it out themselves.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
